"AU Direct Debit" = "AU tiesioginis debetas";

"Affirm" = "Affirm";

"Afterpay" = "Afterpay";

"Alipay" = "„Alipay“";

"BLIK" = "BLIK";

"Bacs Direct Debit" = "„Bacs“ tiesioginis debetas";

"Bancontact" = "„Bancontact“";

"Boleto" = "Boleto";

"Card" = "Kortelė";

"Cash App Pay" = "Cash App Pay";

"Clearpay" = "Clearpay";

"EPS" = "EPS";

"FPX" = "FPX";

"GrabPay" = "GrabPay";

"Klarna" = "Klarna";

"Konbini" = "Konbini";

"Link" = "\"Link\"";

"NetBanking" = "NetBanking";

"OXXO" = "OXXO";

"PayPal" = "PayPal";

"Przelewy24" = "Przelewy24";

"SEPA Debit" = "SEPA debetas";

"Sofort" = "Sofort";

"Swish" = "Swish";

"Timed out authenticating your payment method -- try again" = "Baigėsi mokėjimo būdui autentifikuoti skirtas laikas, bandykite dar kartą";

"UPI" = "UPI";

"US bank account" = "JAV banko sąskaita";

"Unknown" = "Nežinoma";

"We are unable to authenticate your payment method. Please choose a different payment method and try again." = "Nepavyko autentifikuoti mokėjimo būdo. Pasirinkite kitą mokėjimo būdą ir bandykite dar kartą.";

"WeChat Pay" = "„WeChat“ mokėjimas";

"giropay" = "giropay";

"iDEAL" = "iDEAL";
